Q1. List any five functions of the pandas library with execution.

In [7]:
import pandas as pd

#1
print(df.describe())
#2
print(df.head(3))
#3
print(df.tail(4))
#4
print(df[['lunch']].isnull())
#5
print(df[['lunch']].fillna('lunch'))

NameError: name 'df' is not defined

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
data = {'A':[23,34,56,7,64], 'B':[56,78,43,7,64], 'C':[65,43,21,7,64]}

index=[]
for i in range(1, len(data['A'])*2, 2):
    index.append(i)

df2 = pd.DataFrame(data, index)
df2

    A   B   C
1  23  56  65
3  34  78  43
5  56  43  21
7   7   7   7
9  64  64  64

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [9]:
df2['Values']=[23,45,67,7,64]
 
def sum_three(col):
    sm = 0
    for i in col[0:3]:
        sm +=i
    return sm

sum_three(df2['Values'])

/tmp/ipykernel_84/1536393306.py:5: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  for i in col[0:3]:

135

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [10]:
df2['Text'] = ['radhe','krishna','kishori','gopal','govind']
df2.reset_index(inplace = True)

In [11]:
word_count=[]
for i in range(len(df2['Text'])):
    word_count.append(len(df2['Text'][i]))

df2['Word_Count'] = word_count
df2

   index   A   B   C  Values     Text  Word_Count
0      1  23  56  65      23    radhe           5
1      3  34  78  43      45  krishna           7
2      5  56  43  21      67  kishori           7
3      7   7   7   7       7    gopal           5
4      9  64  64  64      64   govind           6

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [12]:
# df.size returns the number of rows* number of columns -> number of elements
print(df2.size)

# df.shape returns the number of rows, number of columns
print(df2.shape)

35
(5, 7)

Q6. Which function of pandas do we use to read an excel file?

In [13]:
# To read an Excel file we use the pandas function read_Excel()
df3 = pd.read_excel('files/training.xlsx')
df3

,gender,race/ethnicity,parental level of education,lunch,test preparation,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,complete,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,75,78,75

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [14]:
df2['Email']=['radhe@gmail.com', 'krishna@gmail.com','kishori@gmail.com','gopal@gmail.com','govind@gmail.com']
df2

   index   A   B   C  Values     Text  Word_Count              Email
0      1  23  56  65      23    radhe           5    radhe@gmail.com
1      3  34  78  43      45  krishna           7  krishna@gmail.com
2      5  56  43  21      67  kishori           7  kishori@gmail.com
3      7   7   7   7       7    gopal           5    gopal@gmail.com
4      9  64  64  64      64   govind           6   govind@gmail.com

In [15]:
df2['Username']=[ st.split(sep='@')[0] for st in df2['Email']]
df2

   index   A   B   C  Values     Text  Word_Count              Email Username
0      1  23  56  65      23    radhe           5    radhe@gmail.com    radhe
1      3  34  78  43      45  krishna           7  krishna@gmail.com  krishna
2      5  56  43  21      67  kishori           7  kishori@gmail.com  kishori
3      7   7   7   7       7    gopal           5    gopal@gmail.com    gopal
4      9  64  64  64      64   govind           6   govind@gmail.com   govind

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [16]:
data3 = {'A':[3,8,6,2,9,8,9] ,'B':[5,2,9,3,1,2,1] ,'C':[1,7,4,5,2,7,2]}
df3= pd.DataFrame(data3)

In [17]:
def funct(df3):
    df = df3[(df3['A']>5) & (df3['B']<10)]
    return df

funct(df3)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2
5  8  2  7
6  9  1  2

# list comprehension 
# operator precedence

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [33]:
def mean_med_std(col):
    return col.describe()[['mean','50%','std']]
    
mean_med_std(df2['Values'])

mean    41.200000
50%     45.000000
std     25.984611
Name: Values, dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [86]:
data = {'Sales': [100, 150, 200, 120, 180],
        'Date': ['2023-08-01', '2023-01-02', '2023-08-03', '2023-08-04', '2023-08-05']}

df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])
print(df)

   Sales       Date
0    100 2023-08-01
1    150 2023-01-02
2    200 2023-08-03
3    120 2023-08-04
4    180 2023-08-05

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [92]:
# def weekday_col(df):
def day(df):
    import datetime
    import calendar

    # The days corresponding to date
    days =[]
    for i in df['Date']:
        j =i.weekday()
        days.append(calendar.day_name[j])
        
     # Adding the days in weekday column
    df['Weekday'] = days

df

   Sales       Date
0    100 2023-08-01
1    150 2023-01-02
2    200 2023-08-03
3    120 2023-08-04
4    180 2023-08-05

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [89]:

df[(df['Date']> '2023-01-01') & (df['Date']< '2023-01-31')]

   Sales       Date
1    150 2023-01-02

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans) To use the basic functions of pandas, 'pandas' library must be the first and foremost library to be imported.